app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
  public function index()
  {
    $title = 'Daftar Artikel';
    $models = new ArtikelModel();
    $artikel = $models->findAll();