app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10
SELECT *
FROM `kategori`
---
  public function admin_index()
  {
    $title = 'Daftar Artikel';
    $q = $this->request->getVar('q') ?? '';
    $models = new ArtikelModel();
    $kategori_id = $this->request->getVar('kategori_id') ?? '';

    $data = [
      'title' => $title,
      'q' => $q,
      'artikel' => $models->like('judul', $q)->paginate(2),
      'pager' => $models->pager,
      'kategori_id' => $kategori_id,
    ];

    $builder = $models->table('artikel')->select('artikel.*, kategori.nama_kategori')->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

    if ($q != '') {
      $builder->like('Artikel.judul', $q);
    }

    if ($kategori_id != '') {
      $builder->where('artikel.id_kategori', $kategori_id);
    }

    $data['artikel'] = $builder->paginate(10);
    $data['pager'] = $models->pager;

    $kategoriModel = new KategoriModel();
    $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---
  public function add()
  { // Validation...
    if ($this->request->getMethod() == 'post' && $this->validate([
      'judul' => 'required',
      'id_kategori' => 'required|integer' // Ensure id_kategori is
    ])) {
      $model = new ArtikelModel();
      $model->insert([
        'judul' => $this->request->getPost('judul'),
        'isi' => $this->request->getPost('isi'),
        'slug' => url_title($this->request->getPost('judul')),
        'id_kategori' => $this->request->getPost('id_kategori')
      ]);
      return redirect()->to('/admin/artikel');
    } else {
      $kategoriModel = new KategoriModel();
      $data['kategori'] = $kategoriModel->findAll(); // Fetch categories