app/Models/ArtikelModel.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
---
  public function getArtikelDenganKategori()
  {
    return $this->db->table('artikel')
      ->select('artikel.*, kategori.nama_kategori')
      ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
      ->get()
      ->getResultArray();